app/controllers/posts_controller.rb

INSERT INTO "posts" ("Description", "Language", "Movie_Scree", "Name", "Price", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
  	@post = Post.new(post_params)
    if @post.save

SELECT "posts".* FROM "posts" ORDER BY "posts"."name" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
def index
  @posts = Post.all
  @posts = Post.page(params[:page]).order(:Name).per(5)